In [65]:
import pandas as pd
import sqlalchemy
import sql_functions as sf

In [66]:
schema = 'organic_africa'

In [89]:
df_1= sf.get_dataframe(f'SELECT * FROM {schema}."OG_Insp_2023__OGOrg_1"')
df_2=sf.get_dataframe(f'SELECT * FROM {schema}."all_purchase"')
df_3=sf.get_dataframe(f'SELECT * FROM {schema}."all_farmers"')

In [ ]:
#all_purchase

In [ ]:
# Assuming your DataFrame is named 'df_1'
column_type = df_1['cereal_harvest_last'].dtypes
print(column_type)

In [90]:
# Convert column names to lowercase in df_1
df_1.rename(columns=str.lower, inplace=True)
df_2.rename(columns=str.lower, inplace=True)
df_3.rename(columns=str.lower, inplace=True)

In [ ]:
# Assuming your DataFrame is named 'df'
df_1['health__care_expenditure'] = df_1['health__care_expenditure'].str.replace(' USD', '')

In [ ]:
df_1.describe()

In [ ]:
import pandas as pd

# Assuming you have a DataFrame called df with 'hh_education_level' and 'children_attending_school' columns

# Group the data by 'hh_education_level' and calculate the average number of children attending school for each group
education_children_avg = df_1.groupby('hh_education_level')['children_attending_school'].mean()

# Print the result
print(education_children_avg)

In [29]:
assets = df_1.groupby('hh_education_level')['assets','cattle','goats/sheep','donkeys','bicycle','motorcycle'].mean()
print(assets)

                             assets    cattle  goats/sheep   donkeys  \
hh_education_level
Advanced level                  1.0  0.000000     2.800000  0.000000
None                            1.0  2.741379     4.887931  0.051724
Ordinary level                  1.0  2.750000     7.890000  0.030000
Primary school                  1.0  2.892655     6.084986  0.056497
Standard 1                      1.0  2.361702     4.276596  0.042553
Tertiary or vocational          1.0  3.111111    14.555556  0.000000
Zimbabwe Junior certificate     1.0  3.190476    11.190476  0.000000

                              bicycle  motorcycle
hh_education_level
Advanced level               0.200000    0.000000
None                         0.060345    0.000000
Ordinary level               0.430000    0.000000
Primary school               0.299435    0.014124
Standard 1                   0.297872    0.000000
Tertiary or vocational       0.333333    0.000000
Zimbabwe Junior certificate  0.333333    0.047619

/var/folders/hg/jgrbrly50wz_1z4gjyycxhzr0000gn/T/ipykernel_56990/2353572350.py:1: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  assets = df_1.groupby('hh_education_level')['assets','cattle','goats/sheep','donkeys','bicycle','motorcycle'].mean()

In [30]:
# what they poses 

columns_to_mean = ['assets', 'cattle', 'goats/sheep', 'donkeys', 'bicycle', 'motorcycle']
assets = df_1.groupby('hh_education_level')[columns_to_mean].mean()
assets

,assets,cattle,goats/sheep,donkeys,bicycle,motorcycle
hh_education_level,,,,,,
Advanced level,1.0,0.000000,2.800000,0.000000,0.200000,0.000000
None,1.0,2.741379,4.887931,0.051724,0.060345,0.000000
Ordinary level,1.0,2.750000,7.890000,0.030000,0.430000,0.000000
Primary school,1.0,2.892655,6.084986,0.056497,0.299435,0.014124
Standard 1,1.0,2.361702,4.276596,0.042553,0.297872,0.000000
Tertiary or vocational,1.0,3.111111,14.555556,0.000000,0.333333,0.000000
Zimbabwe Junior certificate,1.0,3.190476,11.190476,0.000000,0.333333,0.047619

In [32]:
#marital status from all
df_1['marital_status_1'].value_counts()

married     492
widowed      97
divorced     56
single        8
Name: marital_status_1, dtype: int64

In [33]:
#gender
df_1['gender_text'].value_counts()

female    598
male       55
Name: gender_text, dtype: int64

In [35]:
#haus hold heads 

df_1['household_head'].value_counts()

husband    446
self       205
father       1
son          1
Name: household_head, dtype: int64

In [37]:
#total count of children and see how many are ther 5-17
total_female = df_1['hm_5-17_years_female'].sum()
total_male = df_1['hm_5-17_years_male'].sum()
total_both_groups = total_female + total_male

In [41]:

total_both_groups

1152

In [39]:
total_female

555

In [40]:
total_male

597

In [43]:
	#children_attending_school
attending_school = df_1['children_attending_school'].sum()
attending_school

862

In [50]:
# why not attending and how many 
total_sum = 0

for value in df_1['how_many_not_attending']:
    try:
        total_sum += int(value)
    except ValueError:
        continue

In [51]:
print(total_sum)

166

In [54]:
df_1['reason_for_not_attending'].value_counts()

None           459
no children     77
Financial       72
no interest     22
under age       19
Distance         2
Ill/sick         1
Disability       1
Name: reason_for_not_attending, dtype: int64

In [55]:
df_1['main_livelihood_activity'].value_counts()

Organic or  Mabagrown farming    330
none                             183
Gardening                         53
Dry land farming                  39
Small business                    34
formal employment                 13
Name: main_livelihood_activity, dtype: int64

In [58]:
grouped_df = df_1.groupby('hh_education_level')['children_attending_school'].sum()
print(grouped_df)

hh_education_level
Advanced level                   7
None                           174
Ordinary level                 120
Primary school                 457
Standard 1                      68
Tertiary or vocational           9
Zimbabwe Junior certificate     27
Name: children_attending_school, dtype: int64

In [64]:
df_1['hh_education_level'].value_counts()

Primary school                 354
None                           117
Ordinary level                 100
Standard 1                      47
Zimbabwe Junior certificate     21
Tertiary or vocational           9
Advanced level                   5
Name: hh_education_level, dtype: int64

In [60]:
#nearsest school,clinic,shop
df_1['nearest_clinic'].mean()

5.978987730061349

In [61]:
df_1['nearest_school'].mean()

3.5265337423312886

In [62]:
df_1['nearest_shops'].mean()

4.501226993865031

In [63]:
import datetime

current_year = 2023

# Assuming 'date_of_birth' is the column name containing the farmers' birth dates in your DataFrame
df_1['date_of_birth'] = pd.to_datetime(df_1['date_of_birth'])  # Convert 'date_of_birth' column to datetime if needed

df_1['age'] = current_year - df_1['date_of_birth'].dt.year  # Calculate age by subtracting birth year from current year

avg_age = df_1['age'].mean()

print(avg_age)

47.787479406919275

In [ ]:
import pandas as pd
pd.set_option('display.max_rows', None)  # Show all rows
pd.set_option('display.max_columns', None)  # Show all columns

# Display the merged DataFrame as a table
display(df_1)

In [72]:
#merged_df = df_1.merge(df_2[['og_nr', 'total_payment_usd']], on='og_nr', how='left')

In [ ]:
#merged_df

In [77]:
grouped_df = df_2.groupby('og_nr')['total_payment_usd'].sum().reset_index()
merged_df = df_1.merge(grouped_df, on='og_nr', how='left')

In [ ]:
merged_df

In [85]:
duplicates = merged_df['og_nr'].duplicated(keep=False)
duplicate_df_1 = merged_df[duplicates].value_counts()
duplicate_df_1

Series([], dtype: int64)

In [86]:
mean_payment_by_education = merged_df.groupby('hh_education_level')['total_payment_usd'].mean()
print(mean_payment_by_education)

hh_education_level
Advanced level                 535.282500
None                           619.208444
Ordinary level                 680.804746
Primary school                 645.302365
Standard 1                     516.126667
Tertiary or vocational         763.522500
Zimbabwe Junior certificate    712.504000
Name: total_payment_usd, dtype: float64

In [91]:
merged_df_3 = merged_df.merge(df_3[['og_nr', 'area']], on='og_nr', how='inner')
mean_payment_by_education_area = merged_df_3.groupby(['hh_education_level', 'area'])['total_payment_usd'].mean()
print(mean_payment_by_education_area)

hh_education_level           area
Advanced level               Binga     535.240000
                             Mbire     535.325000
None                         Binga     662.650732
                             Mbire     173.925000
Ordinary level               Binga     871.183333
                             Mbire      68.873571
Primary school               Binga     752.685274
                             Mbire     105.703250
Standard 1                   Binga     531.648333
                             Mbire     391.953333
Tertiary or vocational       Binga    1391.820000
                             Mbire     135.225000
Zimbabwe Junior certificate  Binga     741.368571
                             Mbire     308.400000
Name: total_payment_usd, dtype: float64

In [ ]:
# we need psycopg2 for raising possible error message
import psycopg2
import sqlalchemy
from sql_functions import sqlalchemy
from sql_functions import get_engine
# Write records stored in a dataframe to SQL database
engine = get_engine()
table_name = 'all_insp_2023'
if engine!=None:
    try:
        df_1.to_sql(name='all_insp_2023', # Name of SQL table variable - at the front its the dataframe!!
                        con=engine, # Engine or connection
                        schema='organic_africa', # your class schema variable
                        if_exists='replace', # Drop the table before inserting new values
                        index=False, # Write DataFrame index as a column
                        chunksize=5000, # Specify the number of rows in each batch to be written at a time
                        method='multi') # Pass multiple values in a single INSERT clause
        print(f"The {table_name} table was imported successfully.")
    # Error handling
    except (Exception, psycopg2.DatabaseError) as error:
        print(error)
        engine = None
else:
    print('No engine')